insert into films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
values
('Аватар',
'Бывший морпех Джейк Салли прикован к инвалидному креслу.
Несмотря на немощное тело, Джейк в душе по-прежнему остается воином.
Он получает задание совершить путешествие в несколько световых лет к базе землян на планете Пандора,
где корпорации добывают редкий минерал, имеющий огромное значение для выхода Земли из
энергетического кризиса.',
2009, 1, 12, 162, 4),
('Мстители: Финал',
'Оставшиеся в живых члены команды Мстителей и их союзники должны разработать новый план,
который поможет противостоять разрушительным действиям могущественного титана Таноса.
После наиболее масштабной и трагической битвы в истории они не могут допустить ошибку.',
2019, 2, 16, 181, 8),
('Джентельмены',
'Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал
схему нелегального обогащения с использованием поместий обедневшей английской аристократии и
очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца,
и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии
других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры,
чернокожих спортсменов и даже русского олигарха.',
2019, 10, 18, 113, 1),
('Омерзительная восьмерка',
'США после Гражданской войны. Легендарный охотник за головами Джон Рут по кличке Вешатель конвоирует
заключенную. По пути к ним прибиваются еще несколько путешественников. Снежная буря вынуждает компанию
искать укрытие в лавке на отшибе, где уже расположилось весьма пёстрое общество: генерал конфедератов,
мексиканец, ковбой… И один из них — не тот, за кого себя выдает.',
2015, 5, 18, 168, 6),
('Джуманджи: Новый уровень',
'Пытаясь спасти Спенсера, снова попавшего в игру, туда же отправляются и остальные. К их удивлению,
правила Джуманджи изменились, и более того - на этот раз в игру затянуло дедулю Спенсера и его
престарелого друга Майло. Чтобы выполнить задания и вернуться домой, друзьям предстоит отправиться
в путешествие по ранее неизведанным и таинственным уголкам Джуманджи – от засушливой пустыни до
заснеженных гор.',
2019, 8, 12, 123, 3),
('Властелин колец: Братство кольца',
'Сказания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет.
Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу. Тихая деревня,
где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник
Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад. Это кольцо
принадлежало когда-то темному властителю Средиземья Саурону, и оно дает большую власть своему обладателю.
Теперь Саурон хочет вернуть себе власть над Средиземьем. Бильбо отдает Кольцо племяннику Фродо,
чтобы тот отнёс его к Роковой Горе и уничтожил.',
2001, 7, 12, 178, 7),
('Однажды в голливуде',
'1969 год, золотой век Голливуда уже закончился. Известный актёр Рик Далтон и его дублер Клифф Бут
пытаются найти свое место в стремительно меняющемся мире киноиндустрии.',
2019, 3, 18, 161, 2),
('Переводчик',
'Афганистан, март 2018 года. Во время спецоперации по поиску оружия талибов отряд сержанта армии США Джона Кинли
попадает в засаду. В живых остаются только сам Джон, получивший ранение, и местный переводчик Ахмед,
который сотрудничает с американцами. Очнувшись на родине, Кинли не помнит, как ему удалось выжить,
но понимает, что именно Ахмед спас ему жизнь, протащив на себе через опасную территорию. Теперь чувство
вины не даёт Джону покоя, и он решает вернуться за Ахмедом и его семьёй, которых в Афганистане усиленно
ищут талибы.',
2023, 2, 18, 123, 10),
('Тор',
'Эпическое приключение происходит как на нашей планете Земля, так и в королевстве богов Асгарде.
В центре истории - Могучий Тор, сильный, но высокомерный воин, чьи безрассудные поступки возрождают древнюю
войну в Асгарде. Тора отправляют в ссылку на Землю, лишают сил и заставляют жить среди обычных людей в качестве
наказания...',
2011, 1, 12, 110, 5),
('Лига справедливости Зака Снайдера',
'Вдохновившись самопожертвованием Супермена, Брюс Уэйн вновь обретает веру в человечество. Он заручается поддержкой
новой союзницы Дианы Принс, чтобы сразиться с ещё более могущественным противником. Бэтмен и Чудо-женщина набирают
команду сверхлюдей для борьбы с пробудившейся угрозой.',
2021, 7, 18, 242, 9);