insert into halls(name, row_count, place_count, description)
values
('2D/3D', 10, 306,
'Стандартные кинозалы с возможностью демонстрации фильмов в 2D и 3D форматах.'),
('VIP', 6, 38,
'Премиальные кинозалы с возможностью демонстрации фильмов в 2D и 3D форматах. Отличительная особенность -
камерная атмосфера, суперкомфортные кресла-реклайнеры с возможностью регулировки и фиксации положения спинки,
подножки и сидения.'),
('Комфорт', 9, 147,
'Кинозалы повышенной комфортности с возможностью демонстрации фильмов в 2D и 3D форматах. Отличительная особенность -
комфортные кожаные кресла, увеличенное расстояние между рядами.'),
('Премиум', 8, 78,
'Премиальные кинозалы с возможностью демонстрации фильмов в 2D и 3D форматах. Отличительная особенность -
камерная атмосфера, комфортные кресла-диваны повышенной комфортности.'),
('Детский зал', 6, 86,
'Специализированные кинозалы для семейного просмотра. Отличительная особенность - ряды цветных кресел с увеличенным
расстоянием для ног, в первом ряду лежат пуфы и удобные диваны-горки. Дети могут спокойно и беспрепятственно
передвигаться по залу во время сеанса.');
